      * ========================================================================== */
      *                                                                            */
      *   COBOLNAME.CBL                                                            */
      *   (C) 2008 AUTHOR                                                          */
      *                                                                            */
      *   DESCRIPTION                                                              */
      *                                                                            */
      * ========================================================================== */
      *PROGRAM DESCRIPTION
       IDENTIFICATION DIVISION.
       PROGRAM-ID.
       AUTHOR.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
      
       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.

       SCREEN SECTION.

      
       PROCEDURE DIVISION.

      
       END PROGRAM.
