       FECHA-HASTA.
           MOVE TAB-MES (WK-FECHA-HASTA-MES) TO WK-FECHA-HASTA-MES-ED
           MOVE WK-FECHA-HASTA-ANHIO       TO WK-FECHA-HASTA-ANHIO-ED.
       F-FECHA-HASTA. EXIT.  