       CODIGO-PLASTICO.
           MOVE WK-PLASTICO-1       TO WK-PLASTICO-1-ED
           MOVE WK-PLASTICO-2       TO WK-PLASTICO-2-ED
           MOVE WK-PLASTICO-3       TO WK-PLASTICO-3-ED
           MOVE WK-PLASTICO-4       TO WK-PLASTICO-4-ED.           
       F-CODIGO-PLASTICO. EXIT.
